n5/src/InformationRegisters/InternalOrderResolutions/InternalOrderResolutions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>InternalOrderResolutions</name>
  <resources>
    <name>Memo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.InternalOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/InformationRegisters/InternalOrderResolutions/Forms/NewMemo/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	setResolutionsParams ();
	
EndProcedure

&AtServer
Procedure setResolutionsParams ()
	
	Resolutions.Parameters.SetParameterValue ( "Document", Record.Document );
	
EndProcedure 

&AtServer
Procedure BeforeWriteAtServer ( Cancel, CurrentObject, WriteParameters )
	
	CurrentObject.User = SessionParameters.User;
	CurrentObject.Date = CurrentSessionDate ();
	
EndProcedure

// *****************************************
// *********** Group

&AtClient
Procedure WriteAndClose ( Command )
	
	if ( Write () ) then
		Close ( Record.Memo );
	endif; 
	
EndProcedure
